backend/app/models/product.rb

  def avg_rating
    count = self.reviews_count
    ratingSum = self.reviews.sum(:rating)
---
SELECT SUM("reviews"."rating") FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]

  def reviews_count
    self.reviews.count
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]

  def favorites_count
    self.favorites.count
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = $1  [["product_id", 5]]