backend/app/models/user.rb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 2]]
---
  def favorites_count
    self.favorites.count

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
---
  def reviews_count
    self.reviews.count