backend/app/serializers/order_serializer.rb

  def order_items
    self.object.order_items.map do |order_item|
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]

  def user
    self.object.order_items.map do |user|
      {name: "#{self.object.user.firstname} #{self.object.user.lastname}", email: self.object.user.email}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]