backend/app/serializers/user_serializer.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 2]]
---
  def favorites
    favs = object.favorites.map do |fav|

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
---
  def reviews
    reviews = object.reviews.map do |rev|