backend/app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "euberman@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: auth_params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def profile
    auth_h = request.headers[:Authorization]
    token = auth_h.split(' ')[1]
    de_token = JWT.decode(token, ENV["jwt_secret"])
    user_id = de_token[0]['user_id']
    @user = User.find_by(id: user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    auth_h = request.headers[:Authorization]
    token = auth_h.split(' ')[1]
    de_token = JWT.decode(token, ENV["jwt_secret"])
    user_id = de_token[0]['user_id']
    @user = User.find_by(id: user_id)