backend/app/controllers/api/v1/favorites_controller.rb

  def show
      @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]