backend/app/controllers/api/v1/orders_controller.rb

    def show
        @order = Order.find_by(id: params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]