backend/app/controllers/api/v1/order_items_controller.rb

  def index
      @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def show
      @order_item = OrderItem.find(params[:id])
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]