backend/app/controllers/api/v1/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
      @review = Review.find_by(id: params[:id])